app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    user = User.find_by(id: params[:id])  # Busca por ID